<?php

return [
    'login' => [
        'not-verified' => 'حسابك لم يتم التحقق منه، يرجى تأكيد الحساب وإعادة تسجيل الدخول مرة أخرى',
        'successful' => 'تم تسجيل الدخول بنجاح',
        'failed' => 'الإيميل او كلمة المرور غير صحيحة',
    ],
    'register' => [
        'successful' => 'لقد تم تسجيلك بنجاح',
    ],
    'verify-code' => [
        'to-many' => 'لقد تجاوزت العدد المسموح للإدخال، يرجى الانتظار :m دقيقة للمحاولة مرة أخرى',
        'validated' => 'لقد تم التحقق من حسابك مسبقاٌ',
        'invalid' => 'الرمز غير صالح',
        'expired' => 'الرمز منتهي الصلاحية',
        'email' => 'لا يوجد حساب بهذا البريد الالكتروني',
    ],
    'forget-password' => [
        'too-many-tries' => 'لقد تخطيت عدد المحاولات المسموح حاول بعد :m ',
        'email-not-verified' => 'الايميل ليس مفعل.',
        'email-not-found' => 'البريد الالكتروني غير موجود.',
        'email-format' => 'صيغة الايميل غير صحيحة',
    ],
    'reset-password' => [
        'updated' => 'تم إعادة تعيين كلمة السر',
    ],
    'check-code' => [
        'no-code' => 'رمز التحقق ليس صحيح',
        '4-digits' => 'يجب ان يتكون رمز التحقق من اربعة ارقام',
        'expired-code' => 'رمز التحقق منتهي',
        'exist' => 'رمز التحقق ليس صحيح',

    ],
    'create-trip' => [
        'belong' => 'يجب ان تكون المركبة ملك السائق',
        'after' => 'يجب ان يكون وقت الرحلة اكبر من الوقت الحالي',
        'successful' => 'تم انشاء الرحلة بنجاح',
    ],
    'vehicle' => [
        'create' => 'تمت اضافة المركبة بنجاح',
        'delete' => [
            'successfully' => 'تم حذف المركبة بنجاح',
            'error' => 'لايمكن حذف هذا المركبة لانها مرتبطة برحلة',
            'not_found' => 'السيارة غير موجوده',
            'not_authorization' => 'لايمكنك حذف مركبة لاتملكها',
        ],
        'update' => [
            'successfully' => 'تم تحديث بيانات المركبة بنجاح',
            'error' => 'لايمكن تحديث بيانات هذا المركبة لانها مرتبطة برحلة',
            'not_found' => 'السيارة غير موجوده',
            'not_authorization' => 'لايمكنك تحديث بيانات مركبة لاتملكها',
        ],

        'delete_image' => [
            'not_authorization' => 'لايمكنك حذف صورة مركبة لاتملكها',
            'not_found' => 'السيارة غير موجوده',
            'successfully' => 'تم حذف الصورة بنجاح',
        ],
    ],
    'delete-trip' => [
        'successful' => 'تم حذف الرحلة بنجاح',
        'booked' => 'لا يمكنك حذف هذه الرحلة لأنها محجوزة مسبقا',
        'not-found' => 'الرحلة غير موجودة',
        'not-yours' => 'لا يمكنك حذف رحلة ليس لك',
    ],
    'sort-error' => [
        'sort-not-allowed' => 'لا يمكن الفلترة بستخدام :not-allowed, يمكنك الفلترة بستخدام :allowed',
    ],
    'filter-error' => [
        'filter-not-allowed' => 'لا يمكن الفلترة باستخدام :not-allowed, يمكنك الفلترة باستخدام :allowed',
    ],
    'driver-vehicle' => [
        'no-vehicle' => 'السائق لا يمتلك اي مركبات',
    ],
    'from_date_grater' => " 'الحقل 'من هذا التاريخ' يجب ان يكون اصغر من حقل 'الى هذا التاريخ",
    'update-trip' => [
        'successful' => 'تم تعديل الرحلة بنجاح',
        'booked' => 'لا يمكنك تعديل هذه الرحلة لأنها محجوزة مسبقا',
        'not-found' => 'الرحلة غير موجودة',
        'not-yours' => 'لا يمكنك تعديل رحلة ليس لك',
    ],
    'booking' => [
        'create' => 'تم الحجز بنجاح',
        'create_failed' => 'لاتوجد مقاعد كافية',
    ],
    'trip-search' => [
        'no-content' => 'لا توجد رحلات',
    ],
    'favorite-trip' => [
        'successful' => 'تم حفظ الرحلة في قائمة المفضلة بنجاح',
        'deleted' => 'تم حذف هذه الرحلة من قائمة المفضلة',
    ],
    'not-found' => 'غير موجود',
    'customer-booking-not-found' => 'عذرا ,لم تحجز اي رحله بعد',
];
